assignments/hw4/hotelapp/wrk2/memcached_singlenode_2000
Running 30s test @ http://127.0.0.1:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 15.802ms, rate sampling interval: 46ms
  Thread calibration: mean lat.: 8.122ms, rate sampling interval: 32ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    12.07ms    6.53ms  27.06ms   61.32%
    Req/Sec     1.01k   226.70     1.45k    65.37%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.88ms
 75.000%   16.88ms
 90.000%   21.09ms
 99.000%   27.06ms
 99.900%   31.12ms
 99.990%   34.17ms
 99.999%   36.58ms
100.000%   36.58ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.767     0.000000            1         1.00
       3.585     0.100000         3993         1.11
       5.451     0.200000         7985         1.25
       7.007     0.300000        11975         1.43
       9.615     0.400000        15960         1.67
      11.879     0.500000        19961         2.00
      12.887     0.550000        21952         2.22
      13.783     0.600000        23950         2.50
      14.735     0.650000        25944         2.86
      15.775     0.700000        27944         3.33
      16.879     0.750000        29937         4.00
      17.455     0.775000        30919         4.44
      18.047     0.800000        31916         5.00
      18.719     0.825000        32921         5.71
      19.455     0.850000        33926         6.67
      20.207     0.875000        34922         8.00
      20.639     0.887500        35412         8.89
      21.087     0.900000        35909        10.00
      21.599     0.912500        36419        11.43
      22.159     0.925000        36915        13.33
      22.783     0.937500        37402        16.00
      23.151     0.943750        37655        17.78
      23.487     0.950000        37902        20.00
      23.871     0.956250        38160        22.86
      24.303     0.962500        38411        26.67
      24.751     0.968750        38657        32.00
      24.975     0.971875        38784        35.56
      25.215     0.975000        38900        40.00
      25.503     0.978125        39024        45.71
      25.807     0.981250        39152        53.33
      26.143     0.984375        39273        64.00
      26.383     0.985938        39334        71.11
      26.623     0.987500        39401        80.00
      26.863     0.989062        39459        91.43
      27.199     0.990625        39522       106.67
      27.615     0.992188        39584       128.00
      27.775     0.992969        39616       142.22
      27.999     0.993750        39646       160.00
      28.287     0.994531        39677       182.86
      28.623     0.995313        39708       213.33
      29.055     0.996094        39742       256.00
      29.215     0.996484        39757       284.44
      29.343     0.996875        39772       320.00
      29.551     0.997266        39786       365.71
      29.855     0.997656        39803       426.67
      30.079     0.998047        39818       512.00
      30.319     0.998242        39825       568.89
      30.527     0.998437        39834       640.00
      30.703     0.998633        39841       731.43
      30.975     0.998828        39850       853.33
      31.247     0.999023        39857      1024.00
      31.487     0.999121        39860      1137.78
      31.759     0.999219        39864      1280.00
      31.919     0.999316        39868      1462.86
      32.191     0.999414        39872      1706.67
      32.319     0.999512        39876      2048.00
      32.383     0.999561        39878      2275.56
      32.447     0.999609        39880      2560.00
      32.495     0.999658        39882      2925.71
      32.607     0.999707        39884      3413.33
      32.831     0.999756        39886      4096.00
      32.863     0.999780        39887      4551.11
      32.895     0.999805        39888      5120.00
      33.503     0.999829        39889      5851.43
      33.599     0.999854        39890      6826.67
      34.175     0.999878        39891      8192.00
      34.175     0.999890        39891      9102.22
      34.815     0.999902        39892     10240.00
      34.815     0.999915        39892     11702.86
      34.911     0.999927        39893     13653.33
      34.911     0.999939        39893     16384.00
      34.911     0.999945        39893     18204.44
      35.167     0.999951        39894     20480.00
      35.167     0.999957        39894     23405.71
      35.167     0.999963        39894     27306.67
      35.167     0.999969        39894     32768.00
      35.167     0.999973        39894     36408.89
      36.575     0.999976        39895     40960.00
      36.575     1.000000        39895          inf
#[Mean    =       12.073, StdDeviation   =        6.526]
#[Max     =       36.544, Total count    =        39895]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  58892 requests in 30.01s, 15.64MB read
Requests/sec:   1962.74
Transfer/sec:    533.87KB