assignments/hw4/hotelapp/wrk2/memcached_singlenode_4000
Running 30s test @ http://127.0.0.1:8080
  2 threads and 100 connections
  Thread calibration: mean lat.: 5.255ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 5.245ms, rate sampling interval: 16ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    14.58ms   41.36ms 231.17ms   94.49%
    Req/Sec     2.07k   459.99     3.80k    81.33%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.80ms
 75.000%    6.52ms
 90.000%    9.95ms
 99.000%  231.17ms
 99.900%  299.52ms
 99.990%  344.58ms
 99.999%  375.04ms
100.000%  381.70ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.291     0.000000            1         1.00
       2.511     0.100000         7981         1.11
       3.137     0.200000        15963         1.25
       3.747     0.300000        23954         1.43
       4.279     0.400000        31929         1.67
       4.795     0.500000        39943         2.00
       5.067     0.550000        43903         2.22
       5.359     0.600000        47937         2.50
       5.679     0.650000        51892         2.86
       6.051     0.700000        55890         3.33
       6.523     0.750000        59881         4.00
       6.811     0.775000        61860         4.44
       7.127     0.800000        63858         5.00
       7.511     0.825000        65844         5.71
       8.047     0.850000        67831         6.67
       8.767     0.875000        69828         8.00
       9.263     0.887500        70835         8.89
       9.951     0.900000        71825        10.00
      10.927     0.912500        72820        11.43
      12.687     0.925000        73816        13.33
      18.319     0.937500        74814        16.00
      47.423     0.943750        75313        17.78
      90.111     0.950000        75811        20.00
     120.511     0.956250        76310        22.86
     141.567     0.962500        76811        26.67
     162.175     0.968750        77309        32.00
     172.927     0.971875        77560        35.56
     183.039     0.975000        77807        40.00
     192.767     0.978125        78057        45.71
     201.983     0.981250        78305        53.33
     211.583     0.984375        78555        64.00
     217.215     0.985938        78682        71.11
     222.719     0.987500        78808        80.00
     227.711     0.989062        78930        91.43
     233.599     0.990625        79054       106.67
     241.023     0.992188        79179       128.00
     244.991     0.992969        79242       142.22
     249.471     0.993750        79303       160.00
     254.975     0.994531        79366       182.86
     260.223     0.995313        79428       213.33
     266.239     0.996094        79492       256.00
     269.055     0.996484        79523       284.44
     272.895     0.996875        79553       320.00
     278.783     0.997266        79583       365.71
     283.391     0.997656        79617       426.67
     286.719     0.998047        79646       512.00
     288.767     0.998242        79662       568.89
     292.351     0.998437        79679       640.00
     294.911     0.998633        79692       731.43
     297.471     0.998828        79711       853.33
     300.031     0.999023        79724      1024.00
     303.103     0.999121        79733      1137.78
     304.895     0.999219        79740      1280.00
     306.175     0.999316        79747      1462.86
     310.527     0.999414        79755      1706.67
     314.623     0.999512        79763      2048.00
     318.207     0.999561        79767      2275.56
     319.487     0.999609        79770      2560.00
     321.023     0.999658        79774      2925.71
     325.119     0.999707        79778      3413.33
     329.727     0.999756        79782      4096.00
     330.239     0.999780        79784      4551.11
     335.359     0.999805        79786      5120.00
     339.711     0.999829        79788      5851.43
     342.015     0.999854        79791      6826.67
     343.039     0.999878        79792      8192.00
     344.575     0.999890        79793      9102.22
     344.831     0.999902        79794     10240.00
     355.583     0.999915        79795     11702.86
     356.607     0.999927        79796     13653.33
     358.911     0.999939        79798     16384.00
     358.911     0.999945        79798     18204.44
     358.911     0.999951        79798     20480.00
     358.911     0.999957        79798     23405.71
     361.215     0.999963        79799     27306.67
     361.215     0.999969        79799     32768.00
     361.215     0.999973        79799     36408.89
     375.039     0.999976        79800     40960.00
     375.039     0.999979        79800     46811.43
     375.039     0.999982        79800     54613.33
     375.039     0.999985        79800     65536.00
     375.039     0.999986        79800     72817.78
     381.695     0.999988        79801     81920.00
     381.695     1.000000        79801          inf
#[Mean    =       14.584, StdDeviation   =       41.363]
#[Max     =      381.440, Total count    =        79801]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  119826 requests in 30.00s, 31.77MB read
Requests/sec:   3994.53
Transfer/sec:      1.06MB